polybassa/WyLight/cc3200/example/udp_socket/main.c
                        }

                    }
                }while(!iRightInput);

            }
            else if(iInput == 4)
            {
              break;
            }
            else
            {
              UART_PRINT("\n\n\rWrong Input");
            }
        }
        UART_PRINT("\n\r");
    }while(1);

    return ;

}

//****************************************************************************
//
//! \brief Opening a UDP client side socket and sending data
//!
//! This function opens a UDP socket and tries to connect to a Server IP_ADDR
//!    waiting on port PORT_NUM.
//!    Then the function will send 1000 UDP packets to the server.
//!
//! \param[in]  port number on which the server will be listening on
//!
//! \return    0 on success, -1 on Error.
//
//****************************************************************************
int BsdUdpClient(unsigned short usPort)
{
  int             iCounter;
  short           sTestBufLen;
  SlSockAddrIn_t  sAddr;
  int             iAddrSize;
  int             iSockID;
  int             iStatus;
  long            lLoopCount = 0;

  // filling the buffer
  for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
  {
    g_cBsdBuf[iCounter] = (char)(iCounter % 10);
  }

  sTestBufLen  = BUF_SIZE;

  //filling the UDP server socket address
  sAddr.sin_family = SL_AF_INET;
  sAddr.sin_port = sl_Htons((unsigned short)usPort);
  sAddr.sin_addr.s_addr = sl_Htonl((unsigned int)g_ulDestinationIp);

  iAddrSize = sizeof(SlSockAddrIn_t);

  // creating a UDP socket
  iSockID = sl_Socket(SL_AF_INET,SL_SOCK_DGRAM, 0);
  if( iSockID < 0 )
  {
    // error
    return -1;
  }

  // for a UDP connection connect is not required
  // sending 1000 packets to the UDP server
  while (lLoopCount < g_ulPacketCount)
  {
    // sending packet
    iStatus = sl_SendTo(iSockID, g_cBsdBuf, sTestBufLen, 0,
                    ( SlSockAddr_t *)&sAddr, iAddrSize);
    if( iStatus <= 0 )
    {
        // error
        sl_Close(iSockID);
        return -1;
    }
    lLoopCount++;
  }

  UART_PRINT("Sent %u packets successfully\n\r",g_ulPacketCount);

  //closing the socket after sending 1000 packets
  sl_Close(iSockID);

  return 0;
}

//****************************************************************************
//
//! \brief Opening a UDP server side socket and receiving data
//!
//! This function opens a UDP socket in Listen mode and waits for an incoming
//! UDP connection.
//!    If a socket connection is established then the function will try to
//!    read 1000 UDP packets from the connected client.
//!
//! \param[in]          port number on which the server will be listening on
//!
//! \return             0 on success, Negative value on Error.
//
//****************************************************************************
int BsdUdpServer(unsigned short usPort)
{
  SlSockAddrIn_t  sAddr;
  SlSockAddrIn_t  sLocalAddr;
  int             iCounter;
  int             iAddrSize;
  int             iSockID;
  int             iStatus;
  long            lLoopCount = 0;
  short           sTestBufLen;

  // filling the buffer
  for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
  {
    g_cBsdBuf[iCounter] = (char)(iCounter % 10);
  }

  sTestBufLen  = BUF_SIZE;
  //filling the UDP server socket address
  sLocalAddr.sin_family = SL_AF_INET;
  sLocalAddr.sin_port = sl_Htons((unsigned short)usPort);
  sLocalAddr.sin_addr.s_addr = 0;

  iAddrSize = sizeof(SlSockAddrIn_t);

  // creating a UDP socket
  iSockID = sl_Socket(SL_AF_INET,SL_SOCK_DGRAM, 0);
  if( iSockID < 0 )
  {
    // error
    return (iSockID);
  }

  // binding the UDP socket to the UDP server address
  iStatus = sl_Bind(iSockID, (SlSockAddr_t *)&sLocalAddr, iAddrSize);
  if( iStatus < 0 )
  {
    // error
    sl_Close(iSockID);
    return(iStatus);
  }

  // no listen or accept is required as UDP is connectionless protocol
  /// waits for 1000 packets from a UDP client
  while (lLoopCount < g_ulPacketCount)
  {
    iStatus = sl_RecvFrom(iSockID, g_cBsdBuf, sTestBufLen, 0,
                     ( SlSockAddr_t *)&sAddr, (SlSocklen_t*)&iAddrSize );

    if( iStatus < 0 )
    {
      // error
      sl_Close(iSockID);
      return(iStatus);
    }
    lLoopCount++;
  }

  UART_PRINT("Recieved %u packets successfully\n\r",g_ulPacketCount);

  //closing the socket after receiving 1000 packets
  sl_Close(iSockID);

  return 0;
}

//****************************************************************************
//
//!  \brief Connecting to a WLAN Accesspoint
//!
//!   This function connects to the required AP (SSID_NAME) with Security
//!   parameters specified in te form of macros at the top of this file
//!
//!   \param[in]              None
//!
//!   \return       status value
//!
//!   \warning    If the WLAN connection fails or we don't aquire an IP
//!            address, It will be stuck in this function forever.
//
//****************************************************************************
static long WlanConnect()
{
    SlSecParams_t secParams = {0};
    INT32 retVal = 0;

    secParams.Key = SECURITY_KEY;
    secParams.KeyLen = strlen(SECURITY_KEY);
    secParams.Type = SECURITY_TYPE;

    retVal = sl_WlanConnect(SSID_NAME, strlen(SSID_NAME), 0, &secParams, 0);
    ASSERT_ON_ERROR(__LINE__, retVal);

    while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
    {
        // Wait for WLAN Event
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
      
    }

    return SUCCESS;

}


//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{

    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t      CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}


//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs) || defined(gcc)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
  //
  // Enable Processor
  //
  MAP_IntMasterEnable();
  MAP_IntEnable(FAULT_SYSTICK);

  PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{
  long retVal = -1;

  //
  // Board Initialization
  //
  BoardInit();

  //
  // uDMA Initialization
  //
  UDMAInit();

  //
  // Configure the pinmux settings for the peripherals exercised
  //
  PinMuxConfig();

  //
  // Configuring UART
  //
  InitTerm();

  //
  // Display banner
  //
  DisplayBanner(APPLICATION_NAME);

