polybassa/WyLight/cc3200/example/udp_socket/main.c
  InitializeAppVariables();

  //
  // Following function configure the device to default state by cleaning
  // the persistent settings stored in NVMEM (viz. connection profiles &
  // policies, power policy etc)
  //
  // Applications may choose to skip this step if the developer is sure
  // that the device is in its desired state at start of applicaton
  //
  // Note that all profiles and persistent settings that were done on the
  // device will be lost
  //
  retVal = ConfigureSimpleLinkToDefaultState();

  if(retVal < 0)
  {
      if (DEVICE_NOT_IN_STATION_MODE == retVal)
          UART_PRINT("Failed to configure the device in its default state \n\r");

      LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Device is configured in default state \n\r");

  //
  // Asumption is that the device is configured in station mode already
  // and it is in its default state
  //
  retVal = sl_Start(0, 0, 0);
  if (retVal < 0 || retVal != ROLE_STA)
  {
      UART_PRINT("Failed to start the device \n\r");
      LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Device started as STATION \n\r");

  UART_PRINT("Connecting to AP: %s ...\r\n",SSID_NAME);

  //
  //Connecting to WLAN AP
  //
  retVal = WlanConnect();
  if(retVal < 0)
  {
      UART_PRINT("Failed to establish connection w/ an AP \n\r");
      LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Connected to AP: %s \n\r",SSID_NAME);

  UART_PRINT("Device IP: %d.%d.%d.%d\n\r\n\r",
        SL_IPV4_BYTE(g_ulIpAddr,3),
        SL_IPV4_BYTE(g_ulIpAddr,2),
        SL_IPV4_BYTE(g_ulIpAddr,1),
        SL_IPV4_BYTE(g_ulIpAddr,0));


  UART_PRINT("Default settings: SSID Name: %s, PORT = %d, Packet Count = %d, "
                "Destination IP: %d.%d.%d.%d\n\r",
          SSID_NAME, g_uiPortNum, g_ulPacketCount, 
          SL_IPV4_BYTE(g_ulDestinationIp,3),
          SL_IPV4_BYTE(g_ulDestinationIp,2),
          SL_IPV4_BYTE(g_ulDestinationIp,1),
          SL_IPV4_BYTE(g_ulDestinationIp,0));

#ifdef USER_INPUT_ENABLE
   UserInput();
#else
   BsdUdpClient(PORT_NUM);
   BsdUdpServer(PORT_NUM);
#endif
  //
  // power off the network processor
  //
  sl_Stop(SL_STOP_TIMEOUT);
  while (1)
  {
     _SlNonOsMainLoopTask();
  }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
